import React from 'react'
import QuestionItem from './QuestionItem.comp'

const QuestionList = () => {
    const questions = [
        {
            id: 1,
            title: 'How React works?',
            answer: `যখন ক্লায়েন্ট সাইডে কোনো এপ তৈরি করা হয় ফেসবুক ডেভেলপাররা লক্ষ্য করলো ব্রাউজারের ডম অনেক স্লো। তাই তারা ভার্চুয়াল ডম তৈরি করলো যা আসলে জাভাস্ক্রিপ্ট ডম ট্রি। যখন ডমে কোনো ডেটা পরিবর্তন বা এড করতে হয় তখন রিয়েক্ট ভার্চুয়াল ডমে পরিবর্তন  করে। এরপর ভার্চুয়াল ডম সবচেয়ে এফিশিয়েন্ট ওয়েতে রিয়েল ডমে পরিবর্তন করে,  এতে সুবিধা হলো ভার্চুয়াল ডম অনেক ফাস্ট কাজটি করে ব্রাউজার ডমের থেকে। কেননা রিয়েক্ট এর এলিমেন্ট তৈরি করা, আপডেট করা জাভাস্ক্রিপ্ট অব্জেক্ট আপডেট করার মতো। কেননা রিয়েক্ট এলিমেন্ট আসলে জাভাস্ক্রিপ্ট অবজেক্ট। যদিও রিয়েক্ট আমরা ক্লায়েন্ট সাইডে ইউজ করি কিন্তু নোড জেএস এর মাধ্যমে সার্ভার সাইডেও রান করতে পারবো।

            Ref: https://www.geeksforgeeks.org/react-js-introduction-working/`
        },
        {
            id: 2,
            title: 'Difference between state and props in React',
            answer: `প্রপ্স এবং স্টেট দুটোই সাধারণত ডেটা  কন্ট্রোল করার জন্য ব্যবহার হয়। 

            প্রপ্স কোনো কম্পোনেন্টে প্যারামিটার হিসেবে রিসিভ করা হয় যা প্যারেন্ট কম্পোনেন্ট থেকে এট্রিবিউটের মতো করে পাঠানো হয়।  আর স্টেট কম্পোনেন্টের ভিতরে ডিক্লেয়ার করা হয়। যদিও আমরা স্টেটকে প্রপ্সের মাধ্যমে চাইল্ড কম্পোনেন্টে পাঠাতে পারি। কিন্তু চেঞ্জ করতে হলে সেটস্টেট ফাংশনের মাধ্যমে চেঞ্জ করতে হয়।
            
            প্রপ্স ইম্মিউটেবল আর স্টেট সেটস্টেট ফাংশন এর মাধ্যমে পরিবর্তন করতে পারি।
            
            সাধারণত যখন ডেটা পরিবর্তন হয় তখন আমরা স্টেট ব্যাবহার করি আর প্রপ্স পরিবর্তন করতে হলে প্যারেন্ট থেকে পরিবর্তন করতে হয়।
            
            প্রপ্স ইউজ করি সাধারণত এক্সটার্নাল ডেটা ব্যবহার করতে আর স্টেট ইউজ করি ইন্টার্নাল ডেটা ব্যবহার করতে।`
        },
    ]
    return questions.map(question => (
        <QuestionItem key={question.id} question={question} />
    ))

}

export default QuestionList